JamieK32/ti-contest/2024-H/2024-h-programming/mspm0g3507-kjm/project/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0G350X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)



#define CPUCLK_FREQ                                                     80000000



/* Defines for Motor_PWM1 */
#define Motor_PWM1_INST                                                    TIMA0
#define Motor_PWM1_INST_IRQHandler                              TIMA0_IRQHandler
#define Motor_PWM1_INST_INT_IRQN                                (TIMA0_INT_IRQn)
#define Motor_PWM1_INST_CLK_FREQ                                        10000000
/* GPIO defines for channel 0 */
#define GPIO_Motor_PWM1_C0_PORT                                            GPIOA
#define GPIO_Motor_PWM1_C0_PIN                                     DL_GPIO_PIN_0
#define GPIO_Motor_PWM1_C0_IOMUX                                  (IOMUX_PINCM1)
#define GPIO_Motor_PWM1_C0_IOMUX_FUNC                 IOMUX_PINCM1_PF_TIMA0_CCP0
#define GPIO_Motor_PWM1_C0_IDX                               DL_TIMER_CC_0_INDEX
/* GPIO defines for channel 1 */
#define GPIO_Motor_PWM1_C1_PORT                                            GPIOA
#define GPIO_Motor_PWM1_C1_PIN                                     DL_GPIO_PIN_1
#define GPIO_Motor_PWM1_C1_IOMUX                                  (IOMUX_PINCM2)
#define GPIO_Motor_PWM1_C1_IOMUX_FUNC                 IOMUX_PINCM2_PF_TIMA0_CCP1
#define GPIO_Motor_PWM1_C1_IDX                               DL_TIMER_CC_1_INDEX

/* Defines for Motor_PWM2 */
#define Motor_PWM2_INST                                                    TIMG8
#define Motor_PWM2_INST_IRQHandler                              TIMG8_IRQHandler
#define Motor_PWM2_INST_INT_IRQN                                (TIMG8_INT_IRQn)
#define Motor_PWM2_INST_CLK_FREQ                                         5000000
/* GPIO defines for channel 0 */
#define GPIO_Motor_PWM2_C0_PORT                                            GPIOA
#define GPIO_Motor_PWM2_C0_PIN                                     DL_GPIO_PIN_7
#define GPIO_Motor_PWM2_C0_IOMUX                                 (IOMUX_PINCM14)
#define GPIO_Motor_PWM2_C0_IOMUX_FUNC                IOMUX_PINCM14_PF_TIMG8_CCP0
#define GPIO_Motor_PWM2_C0_IDX                               DL_TIMER_CC_0_INDEX
/* GPIO defines for channel 1 */
#define GPIO_Motor_PWM2_C1_PORT                                            GPIOA
#define GPIO_Motor_PWM2_C1_PIN                                    DL_GPIO_PIN_22
#define GPIO_Motor_PWM2_C1_IOMUX                                 (IOMUX_PINCM47)
#define GPIO_Motor_PWM2_C1_IOMUX_FUNC                IOMUX_PINCM47_PF_TIMG8_CCP1
#define GPIO_Motor_PWM2_C1_IDX                               DL_TIMER_CC_1_INDEX



/* Defines for UART_0 */
#define UART_0_INST                                                        UART0
#define UART_0_INST_IRQHandler                                  UART0_IRQHandler
#define UART_0_INST_INT_IRQN                                      UART0_INT_IRQn
#define GPIO_UART_0_RX_PORT                                                GPIOA
#define GPIO_UART_0_TX_PORT                                                GPIOA
#define GPIO_UART_0_RX_PIN                                        DL_GPIO_PIN_11
#define GPIO_UART_0_TX_PIN                                        DL_GPIO_PIN_10
#define GPIO_UART_0_IOMUX_RX                                     (IOMUX_PINCM22)
#define GPIO_UART_0_IOMUX_TX                                     (IOMUX_PINCM21)
#define GPIO_UART_0_IOMUX_RX_FUNC                      IOMUX_PINCM22_PF_UART0_RX
#define GPIO_UART_0_IOMUX_TX_FUNC                      IOMUX_PINCM21_PF_UART0_TX
#define UART_0_BAUD_RATE                                                (115200)
#define UART_0_IBRD_40_MHZ_115200_BAUD                                      (21)
#define UART_0_FBRD_40_MHZ_115200_BAUD                                      (45)
/* Defines for UART_1 */
#define UART_1_INST                                                        UART3
#define UART_1_INST_IRQHandler                                  UART3_IRQHandler
#define UART_1_INST_INT_IRQN                                      UART3_INT_IRQn
#define GPIO_UART_1_RX_PORT                                                GPIOB
#define GPIO_UART_1_TX_PORT                                                GPIOB
#define GPIO_UART_1_RX_PIN                                         DL_GPIO_PIN_3
#define GPIO_UART_1_TX_PIN                                         DL_GPIO_PIN_2
#define GPIO_UART_1_IOMUX_RX                                     (IOMUX_PINCM16)
#define GPIO_UART_1_IOMUX_TX                                     (IOMUX_PINCM15)
#define GPIO_UART_1_IOMUX_RX_FUNC                      IOMUX_PINCM16_PF_UART3_RX
#define GPIO_UART_1_IOMUX_TX_FUNC                      IOMUX_PINCM15_PF_UART3_TX
#define UART_1_BAUD_RATE                                                (115200)
#define UART_1_IBRD_80_MHZ_115200_BAUD                                      (43)
#define UART_1_FBRD_80_MHZ_115200_BAUD                                      (26)




/* Defines for SPI_0 */
#define SPI_0_INST                                                         SPI1
#define SPI_0_INST_IRQHandler                                   SPI1_IRQHandler
#define SPI_0_INST_INT_IRQN                                       SPI1_INT_IRQn
#define GPIO_SPI_0_PICO_PORT                                              GPIOB
#define GPIO_SPI_0_PICO_PIN                                      DL_GPIO_PIN_15
#define GPIO_SPI_0_IOMUX_PICO                                   (IOMUX_PINCM32)
#define GPIO_SPI_0_IOMUX_PICO_FUNC                   IOMUX_PINCM32_PF_SPI1_PICO
#define GPIO_SPI_0_POCI_PORT                                              GPIOA
#define GPIO_SPI_0_POCI_PIN                                      DL_GPIO_PIN_16
#define GPIO_SPI_0_IOMUX_POCI                                   (IOMUX_PINCM38)
#define GPIO_SPI_0_IOMUX_POCI_FUNC                   IOMUX_PINCM38_PF_SPI1_POCI
/* GPIO configuration for SPI_0 */
#define GPIO_SPI_0_SCLK_PORT                                              GPIOA
#define GPIO_SPI_0_SCLK_PIN                                      DL_GPIO_PIN_17
#define GPIO_SPI_0_IOMUX_SCLK                                   (IOMUX_PINCM39)
#define GPIO_SPI_0_IOMUX_SCLK_FUNC                   IOMUX_PINCM39_PF_SPI1_SCLK



/* Defines for DMA_CH0 */
#define DMA_CH0_CHAN_ID                                                      (0)
#define UART_0_INST_DMA_TRIGGER                              (DMA_UART0_TX_TRIG)



/* Port definition for Pin Group PORTB */
#define PORTB_PORT                                                       (GPIOB)

/* Defines for LED_R: GPIOB.26 with pinCMx 57 on package pin 28 */
#define PORTB_LED_R_PIN                                         (DL_GPIO_PIN_26)
#define PORTB_LED_R_IOMUX                                        (IOMUX_PINCM57)
/* Defines for LED_G: GPIOB.27 with pinCMx 58 on package pin 29 */
#define PORTB_LED_G_PIN                                         (DL_GPIO_PIN_27)
#define PORTB_LED_G_IOMUX                                        (IOMUX_PINCM58)
/* Defines for LED_B: GPIOB.22 with pinCMx 50 on package pin 21 */
#define PORTB_LED_B_PIN                                         (DL_GPIO_PIN_22)
#define PORTB_LED_B_IOMUX                                        (IOMUX_PINCM50)
/* Defines for OLED_RST: GPIOB.16 with pinCMx 33 on package pin 4 */
#define PORTB_OLED_RST_PIN                                      (DL_GPIO_PIN_16)
#define PORTB_OLED_RST_IOMUX                                     (IOMUX_PINCM33)
/* Defines for OLED_DC: GPIOB.17 with pinCMx 43 on package pin 14 */
#define PORTB_OLED_DC_PIN                                       (DL_GPIO_PIN_17)
#define PORTB_OLED_DC_IOMUX                                      (IOMUX_PINCM43)
/* Defines for OLED_CS: GPIOB.20 with pinCMx 48 on package pin 19 */
#define PORTB_OLED_CS_PIN                                       (DL_GPIO_PIN_20)
#define PORTB_OLED_CS_IOMUX                                      (IOMUX_PINCM48)
/* Defines for KEY1: GPIOB.12 with pinCMx 29 on package pin 64 */
#define PORTB_KEY1_PIN                                          (DL_GPIO_PIN_12)
#define PORTB_KEY1_IOMUX                                         (IOMUX_PINCM29)
/* Defines for KEY2: GPIOB.8 with pinCMx 25 on package pin 60 */
#define PORTB_KEY2_PIN                                           (DL_GPIO_PIN_8)
#define PORTB_KEY2_IOMUX                                         (IOMUX_PINCM25)
/* Defines for KEY3: GPIOB.9 with pinCMx 26 on package pin 61 */
#define PORTB_KEY3_PIN                                           (DL_GPIO_PIN_9)
#define PORTB_KEY3_IOMUX                                         (IOMUX_PINCM26)
/* Defines for KEY4: GPIOB.10 with pinCMx 27 on package pin 62 */
#define PORTB_KEY4_PIN                                          (DL_GPIO_PIN_10)
#define PORTB_KEY4_IOMUX                                         (IOMUX_PINCM27)
/* Defines for ENCODER_1: GPIOB.4 with pinCMx 17 on package pin 52 */
// pins affected by this interrupt request:["ENCODER_1","ENCODER_2","ENCODER_3","ENCODER_4","ENCODER_5","ENCODER_6","ENCODER_7","ENCODER_8"]
#define PORTB_INT_IRQN                                          (GPIOB_INT_IRQn)
#define PORTB_INT_IIDX                          (DL_INTERRUPT_GROUP1_IIDX_GPIOB)
#define PORTB_ENCODER_1_IIDX                                 (DL_GPIO_IIDX_DIO4)
#define PORTB_ENCODER_1_PIN                                      (DL_GPIO_PIN_4)
#define PORTB_ENCODER_1_IOMUX                                    (IOMUX_PINCM17)
/* Defines for ENCODER_2: GPIOB.5 with pinCMx 18 on package pin 53 */
#define PORTB_ENCODER_2_IIDX                                 (DL_GPIO_IIDX_DIO5)
#define PORTB_ENCODER_2_PIN                                      (DL_GPIO_PIN_5)
#define PORTB_ENCODER_2_IOMUX                                    (IOMUX_PINCM18)
/* Defines for ENCODER_3: GPIOB.6 with pinCMx 23 on package pin 58 */
#define PORTB_ENCODER_3_IIDX                                 (DL_GPIO_IIDX_DIO6)
#define PORTB_ENCODER_3_PIN                                      (DL_GPIO_PIN_6)
#define PORTB_ENCODER_3_IOMUX                                    (IOMUX_PINCM23)
/* Defines for ENCODER_4: GPIOB.7 with pinCMx 24 on package pin 59 */
#define PORTB_ENCODER_4_IIDX                                 (DL_GPIO_IIDX_DIO7)
#define PORTB_ENCODER_4_PIN                                      (DL_GPIO_PIN_7)
#define PORTB_ENCODER_4_IOMUX                                    (IOMUX_PINCM24)
/* Defines for ENCODER_5: GPIOB.19 with pinCMx 45 on package pin 16 */
#define PORTB_ENCODER_5_IIDX                                (DL_GPIO_IIDX_DIO19)
#define PORTB_ENCODER_5_PIN                                     (DL_GPIO_PIN_19)
#define PORTB_ENCODER_5_IOMUX                                    (IOMUX_PINCM45)
/* Defines for ENCODER_6: GPIOB.18 with pinCMx 44 on package pin 15 */
#define PORTB_ENCODER_6_IIDX                                (DL_GPIO_IIDX_DIO18)
#define PORTB_ENCODER_6_PIN                                     (DL_GPIO_PIN_18)
#define PORTB_ENCODER_6_IOMUX                                    (IOMUX_PINCM44)
/* Defines for ENCODER_7: GPIOB.23 with pinCMx 51 on package pin 22 */
#define PORTB_ENCODER_7_IIDX                                (DL_GPIO_IIDX_DIO23)
#define PORTB_ENCODER_7_PIN                                     (DL_GPIO_PIN_23)
#define PORTB_ENCODER_7_IOMUX                                    (IOMUX_PINCM51)
/* Defines for ENCODER_8: GPIOB.13 with pinCMx 30 on package pin 1 */
#define PORTB_ENCODER_8_IIDX                                (DL_GPIO_IIDX_DIO13)
#define PORTB_ENCODER_8_PIN                                     (DL_GPIO_PIN_13)
#define PORTB_ENCODER_8_IOMUX                                    (IOMUX_PINCM30)
/* Port definition for Pin Group PORTA */
#define PORTA_PORT                                                       (GPIOA)

/* Defines for BEEP: GPIOA.27 with pinCMx 60 on package pin 31 */
#define PORTA_BEEP_PIN                                          (DL_GPIO_PIN_27)
#define PORTA_BEEP_IOMUX                                         (IOMUX_PINCM60)
/* Defines for SCL1: GPIOA.12 with pinCMx 34 on package pin 5 */
#define PORTA_SCL1_PIN                                          (DL_GPIO_PIN_12)
#define PORTA_SCL1_IOMUX                                         (IOMUX_PINCM34)
/* Defines for SDA1: GPIOA.13 with pinCMx 35 on package pin 6 */
#define PORTA_SDA1_PIN                                          (DL_GPIO_PIN_13)
#define PORTA_SDA1_IOMUX                                         (IOMUX_PINCM35)
/* Defines for SCL2: GPIOA.8 with pinCMx 19 on package pin 54 */
#define PORTA_SCL2_PIN                                           (DL_GPIO_PIN_8)
#define PORTA_SCL2_IOMUX                                         (IOMUX_PINCM19)
/* Defines for SDA2: GPIOA.26 with pinCMx 59 on package pin 30 */
#define PORTA_SDA2_PIN                                          (DL_GPIO_PIN_26)
#define PORTA_SDA2_IOMUX                                         (IOMUX_PINCM59)
/* Defines for HC595_DS: GPIOA.25 with pinCMx 55 on package pin 26 */
#define PORTA_HC595_DS_PIN                                      (DL_GPIO_PIN_25)
#define PORTA_HC595_DS_IOMUX                                     (IOMUX_PINCM55)
/* Defines for HC595_SHCP: GPIOA.15 with pinCMx 37 on package pin 8 */
#define PORTA_HC595_SHCP_PIN                                    (DL_GPIO_PIN_15)
#define PORTA_HC595_SHCP_IOMUX                                   (IOMUX_PINCM37)
/* Defines for HC595_STCP: GPIOA.14 with pinCMx 36 on package pin 7 */
#define PORTA_HC595_STCP_PIN                                    (DL_GPIO_PIN_14)
#define PORTA_HC595_STCP_IOMUX                                   (IOMUX_PINCM36)

/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_Motor_PWM1_init(void);
void SYSCFG_DL_Motor_PWM2_init(void);
void SYSCFG_DL_UART_0_init(void);
void SYSCFG_DL_UART_1_init(void);
void SYSCFG_DL_SPI_0_init(void);
void SYSCFG_DL_DMA_init(void);


bool SYSCFG_DL_saveConfiguration(void);
bool SYSCFG_DL_restoreConfiguration(void);

#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
